Revit 2024 API
FlowConversionMode Enumeration
 Enumerated type listing possible flow conversion modes for piping calculations.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public enum FlowConversionMode
Visual Basic
Public Enumeration FlowConversionMode
Visual C++
public enum class FlowConversionMode
Members
Member name | Description
Invalid |  A default value which should not be assigned to system types.
Valves |  Predominantly flush valves.
Tanks |  Predominantly flush tanks.
See Also
Autodesk.Revit.DB.Plumbing Namespace